<script lang="ts" setup>
import { FeedbackForm } from 'src/features/feedback-form';

defineOptions({
  name: 'FAQPage',
});

const helpMailUrl = process.env.APP_HELP_MAIL_URL;
</script>

<template>
  <q-page class="q-px-lg q-pb-lg" :class="$style.root">
    <h4 class="q-mb-lg">Часто задаваемые вопросы (FAQ)</h4>

    <h6>1. Общие вопросы</h6>
    <ul>
      <li>
        <strong>Что такое "По пути"?</strong>
        <p>
          "По пути" – это сервис, который помогает водителям и пассажирам находить друг друга для совместных
          междугородних поездок.
        </p>
      </li>
      <li>
        <strong>Как работает "По пути"?</strong>
        <p>
          Водители создают объявления о поездках, указывая маршрут и время отправления. Пассажиры могут искать доступные
          поездки по нужному направлению и бронировать место.
        </p>
      </li>
    </ul>

    <h6>2. Вопросы для водителей</h6>
    <ul>
      <li>
        <strong>Как опубликовать поездку?</strong>
        <p>
          Перейдите в раздел "Опубликовать", укажите маршрут, время отправления, количество свободных мест и
          дополнительные условия, если они есть.
        </p>
      </li>
      <li>
        <strong>Как я узнаю, что кто-то забронировал место в моей машине?</strong>
        <p>
          Вы можете перейти в раздел "Ваши поездки", выбрать поездку и просмотреть информацию о пассажирах и занятых
          местах. Функционал уведомлений добавится в следующих версиях приложения
        </p>
      </li>
      <li>
        <strong>Могу ли я отменить поездку?</strong>
        <p>
          Да, вы можете отменить поездку, но мы рекомендуем делать это как можно раньше, чтобы пассажиры успели найти
          альтернативу.
        </p>
      </li>
    </ul>

    <h6>3. Вопросы для пассажиров</h6>
    <ul>
      <li>
        <strong>Как найти поездку?</strong>
        <p>
          Воспользуйтесь строкой поиска на главной странице, введите пункт отправления и назначения, и выберите
          подходящую поездку из списка.
        </p>
      </li>
      <li>
        <strong>Как забронировать место?</strong>
        <p>
          Выберите подходящую поездку, нажмите кнопку "Забронировать". Ваша поездка отобразится в разделе "Ваши
          поездки".
        </p>
      </li>
      <li>
        <strong>Что делать, если водитель отменил поездку?</strong>
        <p>
          Проверяйте статус поездки в разделе "Ваши поездки". Функционал уведомлений добавится в следующих версиях
          приложения
        </p>
      </li>
    </ul>

    <h6>4. Безопасность и отзывы</h6>
    <ul>
      <li>
        <strong>Когда будут доступны рейтинги и отзывы?</strong>
        <p>
          Мы активно работаем над этой функцией и планируем запустить ее в ближайших обновлениях. Пока что, мы
          рекомендуем обращаться к нашей поддержке в случае любых вопросов или проблем.
        </p>
      </li>
      <li>
        <strong>Как обеспечить свою безопасность во время поездки?</strong>
        <p>
          Рекомендуем заранее обсудить детали поездки с водителем или пассажирами, убедиться, что у всех есть актуальная
          информация о маршруте и времени. Также обратите внимание на профили участников, где будут указаны их
          предыдущие поездки и предпочтения.
        </p>
      </li>
    </ul>

    <h6>5. Технические вопросы</h6>
    <ul>
      <li>
        <strong>Как изменить мои личные данные?</strong>
        <p>
          Перейдите в раздел "Профиль" и выберите "Редактировать". Здесь вы можете изменить свои данные, такие как имя,
          контактная информация и предпочитаемый способ связи.
        </p>
      </li>
    </ul>

    <h6>Связаться с поддержкой</h6>

    <p>
      Если вы не нашли ответа на свой вопрос, напишите нам по адресу
      <a
        :href="`mailto:${helpMailUrl}`"
        target="_blank"
        class="text-primary"
        >{{ helpMailUrl }}</a
      >
      или воспользуйтесь формой обратной связи ниже. Мы постараемся помочь вам как можно быстрее!
    </p>

    <feedback-form />
  </q-page>
</template>

<style lang="scss" module>
.root {
  h1,
  h2,
  p,
  h4,
  h5,
  h6,
  p {
    margin-bottom: 1rem;
  }

  ul {
    padding: 0;
    padding-left: 1em;

    li {
      list-style-type: '— ';
    }
  }
}
</style>

<route lang="yaml">
meta:
  layout: subPage
  fallbackRoute: '/help'
</route>
