<script lang="ts" setup>
defineOptions({
  name: 'AboutPage',
});

const helpMailUrl = process.env.APP_HELP_MAIL_URL;
</script>

<template>
  <q-page padding>
    <h4 class="q-px-md q-mb-sm">О нас</h4>

    <strong class="q-pa-md block">
      Добро пожаловать в "По пути" – сервис, который делает ваши междугородние поездки комфортнее, удобнее и доступнее!
    </strong>

    <p class="q-pa-md">
      Мы понимаем, как важно иногда найти попутчиков для дальних поездок: будь то разделение расходов на топливо, поиск
      компании для дороги или просто желание сделать поездку менее утомительной. Идея создать "По пути" возникла, когда
      мы заметили, что многие люди уже ищут попутчиков в соцсетях, но процесс этот зачастую неудобный и требует много
      времени.
    </p>

    <p class="q-pa-md">
      <strong>"По пути" объединяет водителей и пассажиров, которым предстоит преодолеть один и тот же маршрут</strong>.
      Наше приложение позволяет легко найти или предложить поездку, создать комфортные условия для всех участников и
      сэкономить на дороге.
    </p>

    <p class="q-pa-md">
      Мы активно развиваем наш сервис, и сейчас он находится на этапе MVP (минимально жизнеспособного продукта). Это
      значит, что многие важные функции, такие как рейтинги и отзывы, еще в разработке. Однако, мы уже стремимся сделать
      ваши поездки проще и безопаснее. Нам очень важна обратная связь от вас – ваших предложений и замечаний, чтобы мы
      могли улучшить и развить наш сервис в соответствии с вашими ожиданиями.
    </p>

    <p class="q-pa-md">
      <strong>Наша миссия</strong> – помочь людям путешествовать вместе, делая это экономично и экологично. Мы верим,
      что совместные поездки не только сокращают расходы, но и способствуют новым знакомствам, приятному общению и даже
      снижению нагрузки на окружающую среду.
    </p>

    <p class="q-pa-md">
      <strong>Нам важна ваша обратная связь!</strong> Пишите нам на
      <a
        :href="`mailto:${{ helpMailUrl }}`"
        target="_blank"
        class="text-primary"
        >{{ helpMailUrl }}</a
      >
      или через форму обратной связи на сайте. Мы всегда рады вашим предложениям и замечаниям.
    </p>

    <p class="q-pa-md">Спасибо, что выбрали "По пути". Вместе – к новым горизонтам!</p>
  </q-page>
</template>

<route lang="yaml">
meta:
  layout: subPage
  fallbackRoute: '/profile'
</route>
