<template>
  <div class="q-pa-md" :class="$style.root">
    <h1 class="text-h5">Пользовательское соглашение</h1>
    <p>Настоящее Пользовательское соглашение (далее — “Соглашение”) регулирует отношения между оператором веб-сайта <a href="https://poputi.tech">https://poputi.tech</a> (далее — “Оператор”) и физическим лицом, использующим веб-сайт (далее — “Пользователь”).</p>
    <p>Пользуясь веб-сайтом, Пользователь соглашается с условиями настоящего Соглашения. Если Пользователь не согласен с условиями Соглашения, он должен незамедлительно прекратить использование веб-сайта.</p>
    
    <h2 class="text-h6">1. Общие положения</h2>
    <p>1.1. Настоящее Соглашение регулирует порядок предоставления и использования сервисов и материалов веб-сайта Оператора.</p>
    <p>1.2. Соглашение вступает в силу с момента использования веб-сайта Пользователем.</p>
    <p>1.3. Оператор оставляет за собой право вносить изменения в Соглашение без уведомления Пользователей. Новая версия Соглашения вступает в силу с момента её размещения на веб-сайте, если иное не предусмотрено новой редакцией Соглашения.</p>
    
    <h2 class="text-h6">2. Предмет Соглашения</h2>
    <p>2.1. Оператор предоставляет Пользователю доступ к информации и сервисам, представленным на веб-сайте <a href="https://poputi.tech">https://poputi.tech</a>.</p>
    <p>2.2. Веб-сайт предоставляет сервисы для поиска попутчиков и взаимодействия между Пользователями (далее — “Сервисы”).</p>
    <p>2.3. Использование Сервисов возможно только при условии принятия Пользователем всех условий настоящего Соглашения.</p>
    
    <h2 class="text-h6">3. Обязанности и права Пользователя</h2>
    <p>3.1. Пользователь обязуется:</p>
    <ul>
        <li>Соблюдать условия настоящего Соглашения.</li>
        <li>Предоставлять достоверную информацию при регистрации (если применимо).</li>
        <li>Не нарушать работу веб-сайта.</li>
        <li>Не использовать веб-сайт для распространения запрещённого или недостоверного контента.</li>
    </ul>
    
    <p>3.2. Пользователь имеет право:</p>
    <ul>
        <li>Использовать Сервисы в рамках Соглашения.</li>
        <li>Получать консультации по вопросам, связанным с работой веб-сайта, направляя запросы Оператору через контактные данные.</li>
    </ul>
    
    <h2 class="text-h6">4. Обязанности и права Оператора</h2>
    <p>4.1. Оператор обязуется:</p>
    <ul>
        <li>Обеспечить доступность веб-сайта для использования Пользователями.</li>
        <li>Соблюдать конфиденциальность персональных данных, предоставленных Пользователями, в соответствии с Политикой обработки персональных данных.</li>
    </ul>
    
    <p>4.2. Оператор имеет право:</p>
    <ul>
        <li>Вносить изменения в функциональность веб-сайта и содержание Сервисов.</li>
        <li>Ограничивать доступ к веб-сайту для Пользователей, нарушающих условия Соглашения.</li>
        <li>Удалять контент, противоречащий законодательству РФ или условиям Соглашения.</li>
    </ul>
    
    <h2 class="text-h6">5. Ответственность</h2>
    <p>5.1. Оператор не несет ответственности за достоверность информации, размещаемой Пользователями на веб-сайте.</p>
    <p>5.2. Оператор не несет ответственности за возможные убытки, возникшие у Пользователя в результате использования веб-сайта.</p>
    <p>5.3. Оператор не гарантирует бесперебойную работу веб-сайта, его соответствие ожиданиям Пользователя и отсутствие ошибок в его работе.</p>
    
    <h2 class="text-h6">6. Конфиденциальность</h2>
    <p>6.1. Оператор обязуется обеспечивать конфиденциальность персональных данных Пользователей в соответствии с Политикой конфиденциальности.</p>
    
    <h2 class="text-h6">7. Заключительные положения</h2>
    <p>7.1. Настоящее Соглашение регулируется законодательством Российской Федерации.</p>
    <p>7.2. Все споры, возникающие между Оператором и Пользователем, подлежат урегулированию в досудебном порядке. В случае невозможности достижения соглашения спор передается на рассмотрение суда по месту нахождения Оператора.</p>
    <p>7.3. Если какое-либо положение Соглашения будет признано недействительным или не имеющим юридической силы, это не повлияет на законность или действительность остальных положений Соглашения.</p>
  </div>
</template>

<style lang="scss" module>
.root {
  h1,
  h2,
  p,
  h4,
  h5,
  h6,
  p {
    margin-bottom: 1rem;
  }

  ul {
    padding: 0;
    padding-left: 1em;

    li {
      list-style-type: '— ';
    }
  }
}
</style>

<route lang="yaml">
meta:
  layout: subPage
</route>
  
  